[
    {
        "about_work": true,
        "title": "Desarrollador de Software Junior",
        "description": "Este paso es fundamental para desarrollar habilidades en programación y entender cómo funcionan los sistemas de software. Como Desarrollador de Software Junior, trabajarás en un equipo de desarrollo de software y aprenderás a diseñar, implementar y probar aplicaciones. Este paso te permitirá entender cómo funcionan las tecnologías de software y cómo se aplican en diferentes contextos. Aprovecha esta oportunidad para aprender diferentes lenguajes de programación y frameworks, y para desarrollar habilidades blandas como la comunicación y el trabajo en equipo.",
        "position-title": "Junior Software Developer",
        "duration": "1-2 años",
        "requirements": [
            "Conocimientos de programación en lenguajes como Java, Python o C++",
            "Experiencia con frameworks y bibliotecas de software",
            "Conocimientos de bases de datos"
        ],
        "abilities": [
            "Comunicación efectiva",
            "Trabajo en equipo",
            "Resolución de problemas"
        ]
    },
    {
        "about_work": true,
        "title": "Ingeniero de Software Sénior",
        "description": "En este paso, te convertirás en un experto en desarrollo de software y liderarás proyectos complejos. Aprovecha esta oportunidad para desarrollar habilidades de liderazgo y para aprender a gestionar proyectos y equipos. Este paso te permitirá trabajar en proyectos más complejos y desafiantes, y te preparará para trabajar en empresas de tecnología punta como Boston Dynamics.",
        "position-title": "Senior Software Engineer",
        "duration": "3-5 años",
        "requirements": [
            "Experiencia en desarrollo de software en lenguajes como Java, Python o C++",
            "Conocimientos de patrones de diseño y arquitectura de software",
            "Experiencia en liderazgo de proyectos y equipo"
        ],
        "abilities": [
            "Liderazgo",
            "Gestión de proyectos",
            "Comunicación efectiva"
        ]
    },
    {
        "about_work": true,
        "title": "Ingeniero de Robots",
        "description": "En este paso, te especializarás en desarrollo de robots y sistemas de automatización. Aprovecha esta oportunidad para aprender sobre diseño de robots, sensores y sistemas de control. Este paso te permitirá trabajar en proyectos que requieren integración de software y hardware, y te preparará para trabajar en empresas de robots como Boston Dynamics.",
        "position-title": "Robotics Engineer",
        "duration": "2-4 años",
        "requirements": [
            "Experiencia en desarrollo de software en lenguajes como C++, Python o MATLAB",
            "Conocimientos de diseño de robots y sistemas de automatización",
            "Experiencia con sensores y sistemas de control"
        ],
        "abilities": [
            "Análisis de problemas",
            "Diseño de sistemas",
            "Trabajo en equipo"
        ]
    },
    {
        "about_work": true,
        "title": "Investigador en Inteligencia Artificial",
        "description": "En este paso, te especializarás en inteligencia artificial y machine learning. Aprovecha esta oportunidad para aprender sobre algoritmos de aprendizaje automático y aplicaciones de inteligencia artificial en robots y sistemas de automatización. Este paso te permitirá trabajar en proyectos que requieren integración de inteligencia artificial y robots, y te preparará para trabajar en empresas de robots como Boston Dynamics.",
        "position-title": "AI Researcher",
        "duration": "2-4 años",
        "requirements": [
            "Experiencia en desarrollo de software en lenguajes como Python, R o MATLAB",
            "Conocimientos de algoritmos de aprendizaje automático y inteligencia artificial",
            "Experiencia con aplicaciones de inteligencia artificial en robots"
        ],
        "abilities": [
            "Análisis de problemas",
            "Diseño de algoritmos",
            "Trabajo en equipo"
        ]
    },
    {
        "about_work": false,
        "title": "Desarrolle habilidades en liderazgo y gestión de proyectos",
        "description": "En este paso, es importante desarrollar habilidades en liderazgo y gestión de proyectos para poder liderar equipos y proyectos complejos en empresas de tecnología punta como Boston Dynamics. Aprovecha esta oportunidad para aprender sobre métodos de gestión de proyectos como Scrum y Agile, y para desarrollar habilidades blandas como la comunicación efectiva y el trabajo en equipo.",
        "courses": [
            " Curso de gestión de proyectos",
            " COURSE de liderazgo efectivo"
        ]
    },
    {
        "about_work": true,
        "title": "Ingeniero de Desarrollo de Producto",
        "description": "En este paso, te convertirás en un experto en desarrollo de productos de robots y sistemas de automatización. Aprovecha esta oportunidad para aprender sobre diseño de productos y desarrollo de prototipos. Este paso te permitirá trabajar en proyectos que requieren integración de software, hardware y diseño de productos.",
        "position-title": "Product Development Engineer",
        "duration": "2-4 años",
        "requirements": [
            "Experiencia en desarrollo de software en lenguajes como C++, Python o MATLAB",
            "Conocimientos de diseño de robots y sistemas de automatización",
            "Experiencia con diseño de productos y prototipos"
        ],
        "abilities": [
            "Análisis de problemas",
            "Diseño de sistemas",
            "Trabajo en equipo"
        ]
    },
    {
        "about_work": false,
        "title": "Participa en competencias y proyectos de robots",
        "description": "En este paso, es importante participar en competencias y proyectos de robots para desarrollar habilidades prácticas y para demostrar tus habilidades en desarrollo de robots y sistemas de automatización. Aprovecha esta oportunidad para aprender y mejorar tus habilidades en desarrollo de robots.",
        "courses": [
            "Participa en competencias de robots como RoboCup o Robotics Olympiad",
            "Desarrolla proyectos de robots en tu tiempo libre"
        ]
    },
    {
        "about_work": true,
        "title": "Ingeniero en Boston Dynamics",
        "description": "En este paso, te convertirás en un experto en desarrollo de robots y sistemas de automatización en Boston Dynamics. Aprovecha esta oportunidad para trabajar en proyectos que requieren integración de software, hardware y diseño de productos. Este paso te permitirá trabajar en una de las empresas más innovadoras y punteras en el mundo de la robótica.",
        "position-title": "Robotics Engineer at Boston Dynamics",
        "duration": "variable",
        "requirements": [
            "Experiencia en desarrollo de software en lenguajes como C++, Python o MATLAB",
            "Conocimientos de diseño de robots y sistemas de automatización",
            "Experiencia con diseño de productos y prototipos"
        ],
        "abilities": [
            "Análisis de problemas",
            "Diseño de sistemas",
            "Trabajo en equipo"
        ]
    }
]